tap "bell-sw/liberica"
tap "jesseduffield/lazygit"
brew "afflib"
brew "harfbuzz"
brew "openjdk"
brew "python@3.13"
brew "ant"
brew "automake"
brew "boost"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "dotnet@6"
brew "ffmpeg"
brew "g-ls"
brew "git"
brew "git-filter-repo"
brew "gsl"
brew "gstreamer"
brew "htop"
brew "httpie"
brew "python@3.12"
brew "libheif"
brew "libtool"
brew "imagemagick"
brew "libewf"
brew "libpq"
brew "llvm"
brew "mkvalidator"
brew "mycli"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "postgresql@15"
brew "pylint"
brew "ripgrep"
brew "rustup"
brew "sl"
brew "testdisk"
brew "tmux"
brew "tree"
brew "wget"
brew "jesseduffield/lazygit/lazygit"
cask "dotnet-sdk"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "mactex-no-gui"
cask "visual-studio-code"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.remotehub"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "nguyenhoanglam.beautiful-dracula"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vue.volar"
vscode "wholroyd.jinja"
